# Table of Content
<ul>
    <li> <a href="#object"> Object Creation </a> </li>
    <li> <a href="#csv">Reading CSV file </a> </li>
    <li> <a href="#viewing"> Viewing data </a> </li>
    <li> <a href="#transposing"> Transposing Your Data</a> </li> 
    <li> <a href="#selection"> Selection</a> </li> 
    <li> <a href="#normalization"> Normalization of Data</a> </li> 
    <li> <a href="#grouping"> Grouping</a> </li> 
    <li> <a href="#concatenation"> Concatenation</a> </li> 
    <li> <a href="#merging"> Merging</a> </li> 
    <li> <a href="#Join"> Join</a> </li> 
</ul>

#Pandas Tutorial

Pandas is a high-level data manipulation tool developed by Wes McKinney. It is built on the Numpy package and its key data structure is called the DataFrame. DataFrames allow you to store and manipulate tabular data in rows of observations and columns of variables

In [1]:
#import the pandas library
import pandas as pd

import numpy as np

<a id='object'></a>
## Object creation

*Create an Empty Pandas Series:*

In [ ]:
x = pd.Series()  
print (x)

Series([], dtype: float64)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

*Creating a Series by passing a list of values, letting pandas create a default integer index:*

In [ ]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [ ]:
pd.get_dummies(s) #converts categorical data to dummy

   1.0  3.0  5.0  6.0  8.0
0    1    0    0    0    0
1    0    1    0    0    0
2    0    0    1    0    0
3    0    0    0    0    0
4    0    0    0    1    0
5    0    0    0    0    1

NaN is used to represent missing data

*Creating Series from Array:*

In [ ]:
info = np.array(['P','a','n','d','a','s'])  
a = pd.Series(info)  
print(a)

0    P
1    a
2    n
3    d
4    a
5    s
dtype: object

*Creating Series from dict:*

In [ ]:
info = {'x' : 0., 'y' : 1., 'z' : 2.}  
a = pd.Series(info)  
print (a)

x    0.0
y    1.0
z    2.0
dtype: float64

*Accessing data from series with Position:*

In [3]:
x = pd.Series([1,2,3],index = ['a','b','c'])  
#retrieve the second element  
print (x['b'])

2

*Create an empty Pandas DataFrame*

In [ ]:
df = pd.DataFrame()  
print (df)

Empty DataFrame
Columns: []
Index: []

*Create a DataFrame using List:*

In [ ]:
x = ['Python', 'Pandas']  

df = pd.DataFrame(x)  
print(df)

        0
0  Python
1  Pandas

*Create a DataFrame from Dict*

In [ ]:
df = pd.DataFrame({'Yes': [50, 21], 'No': [131, 2]}, index=['Product A', 'Product B'])
df

           Yes   No
Product A   50  131
Product B   21    2

<a id='csv'></a>
## Reading CSV file

In [14]:
data = pd.read_csv('/content/drive/MyDrive/weather_data (1).csv') #This command reads the files in this location
data

       Unnamed: 0  Temp_degF  ...  Solar_WatPerSqM  Percipitation_in
0               1     69.386  ...          354.000               0.0
1               2     73.796  ...          486.300               0.0
2               3     73.346  ...          679.600               0.0
3               4     71.852  ...          581.800               0.0
4               5     69.314  ...          450.000               0.0
...           ...        ...  ...              ...               ...
43904       87815     52.754  ...            0.000               0.0
43905       87823     52.700  ...            0.005               0.0
43906       87833     52.916  ...            0.000               0.0
43907       87843     52.736  ...            0.001               0.0
43908       87853     52.520  ...            0.007               0.0

[43909 rows x 11 columns]

In [15]:
#following can be used to read excel files
data1 = pd.read_excel('file location') #This command reads the files in this location
data1

FileNotFoundError: ignored

<a id='viewing'></a>
## Viewing data
Here is how to view the top and bottom rows of the frame:

In [16]:
data.head(3)#displays first three rows of the dataframe

   Unnamed: 0  Temp_degF  ...  Solar_WatPerSqM  Percipitation_in
0           1     69.386  ...            354.0               0.0
1           2     73.796  ...            486.3               0.0
2           3     73.346  ...            679.6               0.0

[3 rows x 11 columns]

In [17]:
data.tail(3)# display the last three rows of the dataframe

       Unnamed: 0  Temp_degF  ...  Solar_WatPerSqM  Percipitation_in
43906       87833     52.916  ...            0.000               0.0
43907       87843     52.736  ...            0.001               0.0
43908       87853     52.520  ...            0.007               0.0

[3 rows x 11 columns]

Display the index & columns:

In [18]:
data.index

RangeIndex(start=0, stop=43909, step=1)

In [19]:
data.columns #it gives the names of columns available in the dataset

Index(['Unnamed: 0', 'Temp_degF', 'Humidity_Pct', 'DewPt_degF', 'Wind_mph',
       'WindDir_degNorth', 'Gust_mph', 'GustDir_degNorth', 'Pressure_Hg',
       'Solar_WatPerSqM', 'Percipitation_in'],
      dtype='object')

describe() shows a quick statistic summary of data:

In [10]:
data.describe()# it gives us a brief description of dataset including mean, percentiles min and max

         Unnamed: 0     Temp_degF  ...  Solar_WatPerSqM  Percipitation_in
count  43909.000000  43909.000000  ...     43909.000000      43909.000000
mean   39506.662507     49.138584  ...       168.731054          0.001297
std    26947.493150     19.782029  ...       246.685276          0.014236
min        1.000000    -21.010000  ...         0.000000          0.000000
25%    13704.000000     34.777400  ...         0.007000          0.000000
50%    38410.000000     49.550000  ...         8.290000          0.000000
75%    63105.000000     63.374000  ...       288.500000          0.000000
max    87853.000000    101.894000  ...      1040.000000          1.240000

[8 rows x 11 columns]

In [11]:
data["Humidity_Pct"].fillna(0, inplace = True) # fills NA or NULL value with 0 if NA present

In [12]:
data.dropna()#remove missing values in dataframe

       Unnamed: 0  Temp_degF  ...  Solar_WatPerSqM  Percipitation_in
0               1     69.386  ...          354.000               0.0
1               2     73.796  ...          486.300               0.0
2               3     73.346  ...          679.600               0.0
3               4     71.852  ...          581.800               0.0
4               5     69.314  ...          450.000               0.0
...           ...        ...  ...              ...               ...
43904       87815     52.754  ...            0.000               0.0
43905       87823     52.700  ...            0.005               0.0
43906       87833     52.916  ...            0.000               0.0
43907       87843     52.736  ...            0.001               0.0
43908       87853     52.520  ...            0.007               0.0

[43909 rows x 11 columns]

In [20]:
data.Humidity_Pct.describe()#Describes the details of asingle column

count    43909.000000
mean        52.954717
std         22.988665
min          5.496000
25%         32.540000
50%         53.140000
75%         72.530000
max        100.000000
Name: Humidity_Pct, dtype: float64

In [21]:
data.Wind_mph.median()#median of the column Wind_mph

4.42690426

In [22]:
data.Wind_mph.max()

46.640198999999996

In [23]:
data.Gust_mph.sum()

517273.64733832

In [ ]:
data["Wind_mph"].duplicated() # it gives boolean values true if the element is unique false if the element repeats

0        False
1        False
2        False
3        False
4        False
         ...
43904     True
43905     True
43906     True
43907     True
43908     True
Name: Wind_mph, Length: 43909, dtype: bool

In [ ]:
data["Wind_mph"].count()#number non empty or non-NA rows in a column

43909

In [ ]:
data.Wind_mph - data.Wind_mph.mean()# finding the difference between the elements and mean in a column

0        8.071243
1        7.605959
2        6.554598
3        3.859085
4        1.610960
           ...
43904   -3.959020
43905   -4.493649
43906   -5.274341
43907   -3.424392
43908   -2.502772
Name: Wind_mph, Length: 43909, dtype: float64

<a id='transposing'></a>
## Transposing your data:

In [ ]:
data.T #transposed the dataframe

                       0           1      ...         43907         43908
Unnamed: 0          1.000000    2.000000  ...  87843.000000  87853.000000
Temp_degF          69.386000   73.796000  ...     52.736000     52.520000
Humidity_Pct       33.760000   21.900000  ...     83.400000     84.400000
DewPt_degF         39.643374   32.487311  ...     47.849849     47.955768
Wind_mph           13.844422   13.379138  ...      2.348787      3.270406
WindDir_degNorth  346.000000  327.000000  ...    144.000000     89.000000
Gust_mph           24.382646   24.069474  ...      5.306022      7.279003
GustDir_degNorth   13.000000  329.000000  ...    176.000000    139.000000
Pressure_Hg        24.971779   24.955626  ...     24.888888     24.911892
Solar_WatPerSqM   354.000000  486.300000  ...      0.001000      0.007000
Percipitation_in    0.000000    0.000000  ...      0.000000      0.000000

[11 rows x 43909 columns]

Sorting by values:

In [ ]:
data.sort_values(by='Temp_degF') #Sorting the dataframe based on the values of 'Temp_degF'

       Unnamed: 0  Temp_degF  ...  Solar_WatPerSqM  Percipitation_in
38961       38384    -21.010  ...            0.059               0.0
38960       38374    -20.110  ...            0.064               0.0
38962       38394    -19.084  ...            0.011               0.0
38958       38354    -18.994  ...            0.058               0.0
38959       38364    -18.760  ...            0.049               0.0
...           ...        ...  ...              ...               ...
8352         8353     98.438  ...          816.000               0.0
8349         8350     98.744  ...          543.500               0.0
26035       84802     99.392  ...          484.300               0.0
8351         8352     99.590  ...          836.000               0.0
8350         8351    101.894  ...         1015.000               0.0

[43909 rows x 11 columns]

In [ ]:
cols = ['Wind_mph', 'Humidity_Pct', 'Pressure_Hg']
labels = [5, 8, 10]
df1 = data.loc[labels, cols] #printing the datapoints in the given columns and indices
df1

    Wind_mph  Humidity_Pct  Pressure_Hg
5   5.608009         28.08    24.998710
8   2.263783         45.29    24.958402
10  5.650510         54.14    24.957250

<a id='selection'></a>
## Selection

In [25]:
data['Wind_mph']

0        13.844422
1        13.379138
2        12.327776
3         9.632264
4         7.384139
           ...
43904     1.814158
43905     1.279530
43906     0.498838
43907     2.348787
43908     3.270406
Name: Wind_mph, Length: 43909, dtype: float64

In [ ]:
s = pd.Series(['a', 'b', 'c', 'd', 'e', 'f'])
df = pd.DataFrame(np.random.randn(6, 4), index=[s], columns=list('ABCD'))#creating a random dataset
df

          A         B         C         D
a -0.324034  0.446027 -1.607552  1.060978
b -0.434785  0.728309  0.123118 -1.504256
c -0.067661  0.731788  1.660296 -0.184330
d -0.970029 -0.301610  1.778262  1.813318
e  0.855229  0.725125 -0.171005  1.205488
f -0.224886 -0.414456 -1.334235 -1.039449

Selecting a single column, which yields a Series, equivalent to df.A:

In [ ]:
df['A']

a   -0.324034
b   -0.434785
c   -0.067661
d   -0.970029
e    0.855229
f   -0.224886
Name: A, dtype: float64

Selecting via [ ], which slices the rows.

In [ ]:
df[0:3]

          A         B         C         D
a -0.324034  0.446027 -1.607552  1.060978
b -0.434785  0.728309  0.123118 -1.504256
c -0.067661  0.731788  1.660296 -0.184330

Select via the position of the passed integers:

In [26]:
data.iloc[3]

Unnamed: 0            4.000000
Temp_degF            71.852000
Humidity_Pct         23.940000
DewPt_degF           33.071755
Wind_mph              9.632264
WindDir_degNorth    327.000000
Gust_mph             18.723188
GustDir_degNorth    334.000000
Pressure_Hg          24.981967
Solar_WatPerSqM     581.800000
Percipitation_in      0.000000
Name: 3, dtype: float64

By integer slices, acting similar to numpy/python:

In [ ]:
df.iloc[3:5, 1:3]

          B         C
d -0.301610  1.778262
e  0.725125 -0.171005

###Boolean indexing

Selecting values from a DataFrame where a boolean condition is met.

In [ ]:
df[df > 0]

NameError: ignored

Copy a DataFrame

In [ ]:
df2 = df.copy()

df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

df2

NameError: ignored

In [ ]:
pd.get_dummies(data=df2, columns=['E']) #returns i in the row where the element is present

In [ ]:
import copy

In [ ]:
df3 = copy.deepcopy(df)#changes in deepcopy is not reflected back to the original

In [ ]:
df2.E.value_counts()

In [ ]:
df2.E.unique()

<a id='normalization'></a>
## Normalization of Data

In [ ]:
df2['F'] = [451, 835, 837, 758, 488, 600]
df2['G'] = (df2.F - df2.F.mean())/df2.F.std()
df2

          A         B         C         D      E    F         G
a  1.265688  0.074064 -1.360383  0.633476    one  451 -1.221817
b -0.738359  1.421744  0.331764 -2.256854    one  835  1.007056
c  0.886621  0.251548 -0.001432 -0.757039    two  837  1.018665
d  0.076800 -0.894248 -0.905930  0.022861  three  758  0.560120
e -0.711521  0.796689 -0.469038  2.942301   four  488 -1.007056
f  1.371378  3.144689  0.113493  0.412602  three  600 -0.356968

<a id='grouping'></a>
## Grouping

In [ ]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                                  'foo', 'bar', 'foo', 'foo'],
                            'B': ['one', 'one', 'two', 'three',
                                  'two', 'two', 'one', 'three'],
                            'C': np.random.randn(8),
                            'D': np.random.randn(8)})

df

     A      B         C         D
0  foo    one -0.716639  1.719959
1  bar    one -0.529809 -0.915553
2  foo    two  0.645909  0.093610
3  bar  three -0.934995  0.897412
4  foo    two  0.735653  0.680054
5  bar    two  0.888354 -0.287468
6  foo    one  1.363253  0.111161
7  foo  three  0.356014 -1.145030

In [ ]:
table = pd.pivot_table(df ,index =['A', 'B'])#prints the 
table

                  C         D
A   B
bar one   -0.791179 -0.701558
    three -1.357535  0.033922
    two   -1.685625 -1.449014
foo one   -0.333348 -0.546715
    three  0.672351 -0.303694
    two    1.477728 -0.142400

In [ ]:
# Grouping and then applying the sum() function to the resulting groups.
c=df.groupby('A')

In [ ]:
c.sum()

            C         D
A
bar -0.576449 -0.305609
foo  2.384191  1.459754

In [ ]:
g=c.get_group('foo') #displays the rows under the group 'foo'
g

     A      B         C         D
0  foo    one -0.919691  0.420129
2  foo    two  1.393257  0.819742
4  foo    two  1.562198 -1.104542
6  foo    one  0.252995 -1.513558
7  foo  three  0.672351 -0.303694

###Renaming

In [ ]:
df.rename(columns={'A': 'AA', 'B': 'BB'})

    AA     BB         C         D
0  foo    one -0.928747 -0.392383
1  bar    one -0.241718 -0.844900
2  foo    two  0.286182 -0.655225
3  bar  three  0.887844  0.067778
4  foo    two -0.333357  0.310838
5  bar    two  0.721052  0.130076
6  foo    one -0.689180 -0.424335
7  foo  three  1.179506  0.247801

In [ ]:
df.rename(index={0: 'firstEntry', 1: 'secondEntry'})

               A      B         C         D
firstEntry   foo    one -0.928747 -0.392383
secondEntry  bar    one -0.241718 -0.844900
2            foo    two  0.286182 -0.655225
3            bar  three  0.887844  0.067778
4            foo    two -0.333357  0.310838
5            bar    two  0.721052  0.130076
6            foo    one -0.689180 -0.424335
7            foo  three  1.179506  0.247801

<a id='concatenation'></a>
# Concatenation

In [ ]:
import pandas as pd
india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","kochi"],
    "temperature": [32,45,30],
    "rain": [0, 6, 7]
})

india_weather

     city  temperature  rain
0  mumbai           32     0
1   delhi           45     6
2   kochi           30     7

In [ ]:
india_weather1 = pd.DataFrame({
    "city": ["pune","chennai","orissa"],
    "temperature": [21,14,35],
    "rain": [0.5, 5, 5]
})
india_weather1

      city  temperature  rain
0     pune           21   0.5
1  chennai           14   5.0
2   orissa           35   5.0

In [ ]:
#concate two dataframes
df = pd.concat([india_weather, india_weather1])
df

      city  temperature  rain
0   mumbai           32   0.0
1    delhi           45   6.0
2    kochi           30   7.0
0     pune           21   0.5
1  chennai           14   5.0
2   orissa           35   5.0

In [ ]:
df.reset_index(inplace = True) # It changes the index of updated dataframe
df

   index     city  temperature  rain
0      0   mumbai           32   0.0
1      1    delhi           45   6.0
2      2    kochi           30   7.0
3      0     pune           21   0.5
4      1  chennai           14   5.0
5      2   orissa           35   5.0

In [ ]:
df = pd.concat([india_weather, india_weather1], ignore_index=True)
df

      city  temperature  rain
0   mumbai           32   0.0
1    delhi           45   6.0
2    kochi           30   7.0
3     pune           21   0.5
4  chennai           14   5.0
5   orissa           35   5.0

In [ ]:
df = pd.concat([india_weather, india_weather1],axis=1)
df

     city  temperature  rain     city  temperature  rain
0  mumbai           32     0     pune           21   0.5
1   delhi           45     6  chennai           14   5.0
2   kochi           30     7   orissa           35   5.0

<a id='merging'></a>
# Merging

In [ ]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore", 'hyderabad'],
    "temperature": [32,45,30,40]})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2   banglore           30
3  hyderabad           40

In [ ]:
humidity_df = pd.DataFrame({
    "city": ["delhi","mumbai","banglore"],
    "humidity": [68, 65, 75]})
humidity_df

       city  humidity
0     delhi        68
1    mumbai        65
2  banglore        75

In [ ]:
#merge two dataframes with out explicitly mention index
df = pd.merge(temperature_df, humidity_df, on='city')
df

       city  temperature  humidity
0    mumbai           32        65
1     delhi           45        68
2  banglore           30        75

In [ ]:
#OUTER-JOIN
df = pd.merge(temperature_df, humidity_df, on='city', how='outer')
df

        city  temperature  humidity
0     mumbai           32      65.0
1      delhi           45      68.0
2   banglore           30      75.0
3  hyderabad           40       NaN

<a id='join'></a>
#Join

In [ ]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore", 'hyderabad'],
    "temperature": [32,45,30,40]})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2   banglore           30
3  hyderabad           40

In [ ]:
humidity_df = pd.DataFrame({
    "city": ["delhi","mumbai","banglore"],
    "humidity": [68, 65, 75]})
humidity_df

       city  humidity
0     delhi        68
1    mumbai        65
2  banglore        75

In [ ]:
temperature_df.join(humidity_df,lsuffix='_temp', rsuffix='_hum')#outer join 2 dataset with syffix to identify the keys

   city_temp  temperature  city_hum  humidity
0     mumbai           32     delhi      68.0
1      delhi           45    mumbai      65.0
2   banglore           30  banglore      75.0
3  hyderabad           40       NaN       NaN

Remember the methods using this chaet sheet :https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf